tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/cask-fonts'
tap 'homebrew/services'
tap 'homebrew/versions'
tap 'homebrew/dupes'
tap 'ngrok/ngrok'

# Packages
brew 'ack'
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew 'asdf'
# brew 'ag'
brew 'autoconf'
# Client for Amazon Elastic Beanstalk web service
brew 'aws-elasticbeanstalk'
# Official Amazon AWS command-line interface
brew 'awscli'
# Manage your dotfiles across multiple diverse machines, securely
brew 'chezmoi'
# GNU File, Shell, and Text utilities
# Install GNU core utilities (those that come with OS X are outdated)
# Don’t forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew 'coreutils'
# cmake is required to compile vim bundle YouCompleteMe
brew 'cmake'
brew 'dark-mode'
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed
brew 'findutils'
brew 'ffmpeg'
brew 'gawk'
brew 'gdbm'
brew 'gnupg'
# Install GNU `sed`, overwriting the built-in `sed`
# so we can do "sed -i 's/foo/bar/' file" instead of "sed -i '' 's/foo/bar/' file"
brew 'gnu-sed', args: ['with-default-names']
# better, more recent grep
brew 'homebrew/dupes/grep'
# https://github.com/jkbrzt/httpie
brew 'httpie'
brew 'imagemagick'
brew 'imagesnap'
# jq is a sort of JSON grep
brew 'jq'
brew 'lame'
brew 'mackup'
# Mac App Store CLI: https://github.com/mas-cli/mas
brew 'mas'
# Install some other useful utilities like `sponge`
brew 'moreutils'
# brew 'mysql@5.5'
# brew 'mysql'
brew 'nmap'
brew 'node'
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
brew 'pkg-config'
brew 'pv'
brew 'python'
brew 'readline'
brew 'rbenv'
brew 'reattach-to-user-namespace'
brew 'redis', restart_service: true
brew 'rename'
brew 'ruby-build'
# better/more recent version of screen
brew 'homebrew/dupes/screen'
brew 'screens-connect'
brew 'speedtest_cli'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'swaks'
brew 'testssl'
brew 'tmux'
brew 'tree'
brew 'ttyrec'
# better, more recent vim
brew 'vim', args: ['with-override-system-vi']
brew 'watch'
brew 'webkit2png'
# Install wget with IRI support
brew 'wget', args: ['enable-iri']
brew 'x264'
brew 'xvid'
# General-purpose data compression with high compression ratio
brew 'xz'
brew 'youtube-dl'
brew 'zsh'
brew 'zsh-syntax-highlighting'
# Zstandard is a real-time compression algorithm
brew 'zstd'

# Applications
cask '1password'
cask 'arc'
# cask 'alfred'
# cask 'anvil'
# cask 'atom'
cask 'bartender'
cask 'basecamp'
cask 'boop'
cask 'chatgpt'
cask 'claude'
# cask 'chefdk'
cask 'cyberduck'
cask 'docker'
# cask 'dropbox'
cask 'fantastical'
# cask "font-hack-nerd-font"
cask 'firefox'
# cask 'flux'
cask 'github'
# GitHub notifications on your menu bar
cask 'gitify'
cask 'google-chrome'
# cask 'gpgtools'
cask 'istat-menus'
cask 'iterm2'
cask 'little-snitch'
cask 'micro-snitch'
cask 'microsoft-office'
# Reverse proxy, secure introspectable tunnels to localhost
cask 'ngrok'
# cask 'owncloud'
cask 'pastebot'
cask 'postman'
# Control your tools with a few keystrokes
cask 'raycast'
# cask 'sizeup'
# cask 'sketchup'
# cask 'skype'
cask 'slack'
cask 'soundsource'
cask 'sublime-merge'
cask 'sublime-text'
# cask 'spectacle'
# cask 'the-unarchiver'
cask 'things'
# cask 'vagrant'
# cask 'vagrant-manager'
# cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'
# cask 'whatsapp'
cask 'zed'
cask 'zoom'

# Mac App Store applications
mas 'Hush Nag Blocker', id: 1544743900
mas 'Sequel Ace', id: 1518036000
mas 'Things 3', id: 904237743
mas 'Tot', id: 1491071483
mas 'Vinegar', id: 1591303229
mas 'Xcode', id: 497799835
# mas 'WhatsApp Messenger', id: 310633997
