tap 'ngrok/ngrok'

# Packages
brew 'ack'
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew 'asdf'
# brew 'ag'
brew 'autoconf'
# Client for Amazon Elastic Beanstalk web service
brew 'aws-elasticbeanstalk'
# Official Amazon AWS command-line interface
brew 'awscli'
# Manage your dotfiles across multiple diverse machines, securely
brew 'chezmoi'
# GNU File, Shell, and Text utilities
# Install GNU core utilities (those that come with OS X are outdated)
# Don’t forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew 'coreutils'
# cmake is required to compile vim bundle YouCompleteMe
brew 'cmake'
brew 'codex'
# Power of curl, ease of use of httpie
brew 'curlie'
brew 'dark-mode'
brew 'dockutil'
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed
brew 'findutils'
# User-friendly command-line shell for UNIX-like operating systems
# brew 'fish'
brew 'ffmpeg'
brew 'gawk'
# GNU compiler collection
brew 'gcc'
brew 'gemini-cli'
# GitHub command-line tool
brew 'gh'
brew 'git'
# Core application library for C
brew 'glib'
brew 'gdbm'
# GNU Transport Layer Security (TLS) Library
brew 'gnutls'
# GNU Pretty Good Privacy (PGP) package
brew 'gnupg'
# Install GNU `sed`, overwriting the built-in `sed`
# so we can do "sed -i 's/foo/bar/' file" instead of "sed -i '' 's/foo/bar/' file"
# brew 'gnu-sed', args: ['with-default-names']
# better, more recent grep
# brew 'homebrew/dupes/grep'
# User-friendly cURL replacement (command-line HTTP client)
brew 'httpie'
# Tools and libraries to manipulate images in many formats
brew 'imagemagick'
brew 'imagesnap'
# Migrate or backup IMAP mail accounts
brew 'imapsync'
# Lightweight and flexible command-line JSON processor
brew 'jq'
brew 'lame'
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew 'libfido2'
# International domain name library
brew 'libidn'
# Postgres C API library
# brew 'libpq', link: true
# Mac App Store CLI: https://github.com/mas-cli/mas
brew 'mas'
# Install some other useful utilities like `sponge`
brew 'moreutils'
# Open source relational database management system
brew 'mysql'
brew 'nmap'
# Platform built on V8 to build network applications
brew 'node'
# Package for scientific computing with Python
brew 'numpy'
# Cryptography and SSL/TLS Toolkit
brew 'openssl@3'
brew 'pinentry-mac'
# brew 'pkg-config'
# brew 'pv'
# Python version management
brew 'pyenv'
# Interpreted, interactive, object-oriented programming language
brew 'python@3.10'
# Interpreted, interactive, object-oriented programming language
brew 'python@3.11'
# Interpreted, interactive, object-oriented programming language
brew 'python@3.9'
# Tensors and dynamic neural networks
brew 'pytorch'
# brew 'rbenv'
# brew 'readline'
# brew 'reattach-to-user-namespace'
# brew 'redis', restart_service: true
brew 'rename'
# Install various Ruby versions and implementations
brew 'ruby-build'
# Safe, concurrent, practical language
brew 'rust'
# better/more recent version of screen
# brew 'homebrew/dupes/screen'
# brew 'screens-connect'
# Database of common MIME types
brew 'shared-mime-info'
# brew 'speedtest_cli'
# brew 'sqlite'
# brew 'ssh-copy-id'
# SMTP command-line test tool
brew 'swaks'
# Tool Command Language
brew 'tcl-tk'
# User interface to the TELNET protocol
brew 'telnet'
brew 'testssl'
# brew 'tmux'
brew 'tree'
brew 'ttyrec'
# Validating, recursive, caching DNS resolver
brew 'unbound'
# better, more recent vim
# brew 'vim', args: ['with-override-system-vi']
brew 'watch'
# Install wget with IRI support
# brew 'wget', args: ['enable-iri']
brew 'x264'
brew 'xvid'
# General-purpose data compression with high compression ratio
brew 'xz'
brew 'zsh'
# Real-time type-ahead completion for Zsh
brew 'zsh-autocomplete'
brew 'zsh-syntax-highlighting'
# Zstandard is a real-time compression algorithm
brew 'zstd'


# Applications
cask '1password'
cask '1password-cli'
cask 'arc'
# cask 'alfred'
# cask 'anvil'
# cask 'atom'
cask 'bartender'
cask 'basecamp'
cask 'boop'
cask 'chatgpt'
cask 'claude'
cask 'copilot-money'
# cask 'chefdk'
cask 'cyberduck'
cask 'docker-desktop'
# cask 'dropbox'
cask 'fantastical'
cask 'font-hack-nerd-font'
cask 'firefox'
# cask 'flux'
cask 'ghostty'
cask 'github'
# GitHub notifications on your menu bar
cask 'gitify'
cask 'google-chrome'
cask 'google-drive'
# cask 'gpgtools'
cask 'istat-menus'
cask 'iterm2'
cask 'little-snitch'
cask 'logseq'
cask 'micro-snitch'
cask 'microsoft-office'
# Reverse proxy, secure introspectable tunnels to localhost
cask 'ngrok'
cask 'notion'
cask 'notion-mail'
cask 'notion-calendar'
cask 'obsidian'
# cask 'owncloud'
cask 'pastebot'
cask 'postman'
cask 'powershell'
# Control your tools with a few keystrokes
cask 'raycast'
cask 'readdle-spark'
cask 'session-manager-plugin'
# cask 'sizeup'
# cask 'sketchup'
# cask 'skype'
cask 'slack'
cask 'soundsource'
cask 'sublime-merge'
cask 'sublime-text'
# cask 'spectacle'
# cask 'the-unarchiver'
# cask 'vagrant'
# cask 'vagrant-manager'
# cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'
# cask 'whatsapp'
cask 'zed'
cask 'zoom'


# Mac App Store applications
mas 'Bear', id: 1091189122
mas 'Drafts', id: 1435957248
mas 'Hush Nag Blocker', id: 1544743900
mas 'Magnet', id: 441258766
mas 'Sequel Ace', id: 1518036000
mas 'Things 3', id: 904280696
mas 'Tot', id: 1491071483
mas 'Trello', id: 1278508951
mas 'Vinegar', id: 1591303229
mas 'Xcode', id: 497799835
# mas 'WhatsApp Messenger', id: 310633997


# Visual Studio Code Extensions
# vscode "bradlc.vscode-tailwindcss"
# vscode "eamodio.gitlens"
# vscode "github.codespaces"
# vscode "github.copilot"
# vscode "github.copilot-chat"
# vscode "github.remotehub"
# vscode "github.vscode-github-actions"
# vscode "github.vscode-pull-request-github"
# vscode "leighlondon.eml"
# vscode "mikestead.dotenv"
# vscode "ms-azuretools.vscode-docker"
# vscode "ms-python.debugpy"
# vscode "ms-python.isort"
# vscode "ms-python.python"
# vscode "ms-python.vscode-pylance"
# vscode "ms-vscode-remote.remote-containers"
# vscode "ms-vscode.atom-keybindings"
# vscode "ms-vscode.azure-repos"
# vscode "ms-vscode.remote-explorer"
# vscode "ms-vscode.remote-repositories"
# vscode "ms-vscode.remote-server"
# vscode "ms-vscode.sublime-keybindings"
# vscode "ms-vsliveshare.vsliveshare"
# vscode "shopify.ruby-lsp"
